hpmicro/rtt-bsp-hpm6750evkmini/rtt_default_project_0/libraries/hpm-sdk/soc/ip/hpm_cam_regs.h
/*
 * SYNC_RXFIFO_CLR (RW)
 *
 * Synchronous Rx FIFO Clear.
 * When asserted, this bit clears RXFIFO on every SOF.
 */
#define CAM_CR1_SYNC_RXFIFO_CLR_MASK (0x80000UL)
#define CAM_CR1_SYNC_RXFIFO_CLR_SHIFT (19U)
#define CAM_CR1_SYNC_RXFIFO_CLR_SET(x) (((uint32_t)(x) << CAM_CR1_SYNC_RXFIFO_CLR_SHIFT) & CAM_CR1_SYNC_RXFIFO_CLR_MASK)
#define CAM_CR1_SYNC_RXFIFO_CLR_GET(x) (((uint32_t)(x) & CAM_CR1_SYNC_RXFIFO_CLR_MASK) >> CAM_CR1_SYNC_RXFIFO_CLR_SHIFT)

/*
 * SOF_INT_POL (RW)
 *
 * SOF Interrupt Polarity. This bit controls the condition that generates an SOF interrupt.
 * 0 SOF interrupt is generated on SOF falling edge
 * 1 SOF interrupt is generated on SOF rising edge
 */
#define CAM_CR1_SOF_INT_POL_MASK (0x20000UL)
#define CAM_CR1_SOF_INT_POL_SHIFT (17U)
#define CAM_CR1_SOF_INT_POL_SET(x) (((uint32_t)(x) << CAM_CR1_SOF_INT_POL_SHIFT) & CAM_CR1_SOF_INT_POL_MASK)
#define CAM_CR1_SOF_INT_POL_GET(x) (((uint32_t)(x) & CAM_CR1_SOF_INT_POL_MASK) >> CAM_CR1_SOF_INT_POL_SHIFT)

/*
 * INV_DATA (RW)
 *
 * Invert Data Input. This bit enables or disables internal inverters on the data lines.
 * 0 CAM_D data lines are directly applied to internal circuitry
 * 1 CAM_D data lines are inverted before applied to internal circuitry
 */
#define CAM_CR1_INV_DATA_MASK (0x8000U)
#define CAM_CR1_INV_DATA_SHIFT (15U)
#define CAM_CR1_INV_DATA_SET(x) (((uint32_t)(x) << CAM_CR1_INV_DATA_SHIFT) & CAM_CR1_INV_DATA_MASK)
#define CAM_CR1_INV_DATA_GET(x) (((uint32_t)(x) & CAM_CR1_INV_DATA_MASK) >> CAM_CR1_INV_DATA_SHIFT)

/*
 * STORAGE_MODE (RW)
 *
 * 00: Normal Mode (one plane mode)
 * 01: Two Plane Mode (Y, UV plane)
 * 10: Y-only Mode, byte sequence as Y0,Y1,Y2,Y3
 * 11: Binary Mode, bit sequence is from LSB to MSB when CR20[BIG_END]=0
 */
#define CAM_CR1_STORAGE_MODE_MASK (0xC00U)
#define CAM_CR1_STORAGE_MODE_SHIFT (10U)
#define CAM_CR1_STORAGE_MODE_SET(x) (((uint32_t)(x) << CAM_CR1_STORAGE_MODE_SHIFT) & CAM_CR1_STORAGE_MODE_MASK)
#define CAM_CR1_STORAGE_MODE_GET(x) (((uint32_t)(x) & CAM_CR1_STORAGE_MODE_MASK) >> CAM_CR1_STORAGE_MODE_SHIFT)

/*
 * COLOR_FORMATS (RW)
 *
 * input color formats:
 * 0010b: 24bit: RGB888
 * 0100b: 16bit: RGB565
 * 0111b: 16bit: YCbCr422 (Y0 Cb Y1 Cr, each 8-bit)
 * YUV
 * YCrCb
 * Note: YUV420 is not supported.
 * 1000b: 24bit: YUV444
 */
#define CAM_CR1_COLOR_FORMATS_MASK (0x78U)
#define CAM_CR1_COLOR_FORMATS_SHIFT (3U)
#define CAM_CR1_COLOR_FORMATS_SET(x) (((uint32_t)(x) << CAM_CR1_COLOR_FORMATS_SHIFT) & CAM_CR1_COLOR_FORMATS_MASK)
#define CAM_CR1_COLOR_FORMATS_GET(x) (((uint32_t)(x) & CAM_CR1_COLOR_FORMATS_MASK) >> CAM_CR1_COLOR_FORMATS_SHIFT)

/*
 * SENSOR_BIT_WIDTH (RW)
 *
 * the bit width of the sensor
 * 0: 8 bits
 * 1: 10 bits
 * Others: Undefined
 */
#define CAM_CR1_SENSOR_BIT_WIDTH_MASK (0x7U)
#define CAM_CR1_SENSOR_BIT_WIDTH_SHIFT (0U)
#define CAM_CR1_SENSOR_BIT_WIDTH_SET(x) (((uint32_t)(x) << CAM_CR1_SENSOR_BIT_WIDTH_SHIFT) & CAM_CR1_SENSOR_BIT_WIDTH_MASK)
#define CAM_CR1_SENSOR_BIT_WIDTH_GET(x) (((uint32_t)(x) & CAM_CR1_SENSOR_BIT_WIDTH_MASK) >> CAM_CR1_SENSOR_BIT_WIDTH_SHIFT)

/* Bitfield definition for register: INT_EN */
/*
 * ERR_CL_BWID_CFG_INT_EN (RW)
 *
 * The unsupported color (color_formats[3:0]) and bitwidth (sensor_bit_width[2:0]) configuation interrupt enable
 */
#define CAM_INT_EN_ERR_CL_BWID_CFG_INT_EN_MASK (0x2000U)
#define CAM_INT_EN_ERR_CL_BWID_CFG_INT_EN_SHIFT (13U)
#define CAM_INT_EN_ERR_CL_BWID_CFG_INT_EN_SET(x) (((uint32_t)(x) << CAM_INT_EN_ERR_CL_BWID_CFG_INT_EN_SHIFT) & CAM_INT_EN_ERR_CL_BWID_CFG_INT_EN_MASK)
#define CAM_INT_EN_ERR_CL_BWID_CFG_INT_EN_GET(x) (((uint32_t)(x) & CAM_INT_EN_ERR_CL_BWID_CFG_INT_EN_MASK) >> CAM_INT_EN_ERR_CL_BWID_CFG_INT_EN_SHIFT)

/*
 * HIST_DONE_INT_EN (RW)
 *
 * Enable hist done int
 */
#define CAM_INT_EN_HIST_DONE_INT_EN_MASK (0x1000U)
#define CAM_INT_EN_HIST_DONE_INT_EN_SHIFT (12U)
#define CAM_INT_EN_HIST_DONE_INT_EN_SET(x) (((uint32_t)(x) << CAM_INT_EN_HIST_DONE_INT_EN_SHIFT) & CAM_INT_EN_HIST_DONE_INT_EN_MASK)
#define CAM_INT_EN_HIST_DONE_INT_EN_GET(x) (((uint32_t)(x) & CAM_INT_EN_HIST_DONE_INT_EN_MASK) >> CAM_INT_EN_HIST_DONE_INT_EN_SHIFT)

/*
 * HRESP_ERR_EN (RW)
 *
 * Hresponse Error Enable. This bit enables the hresponse error interrupt.
 * 0 Disable hresponse error interrupt
 * 1 Enable hresponse error interrupt
 */
#define CAM_INT_EN_HRESP_ERR_EN_MASK (0x800U)
#define CAM_INT_EN_HRESP_ERR_EN_SHIFT (11U)
#define CAM_INT_EN_HRESP_ERR_EN_SET(x) (((uint32_t)(x) << CAM_INT_EN_HRESP_ERR_EN_SHIFT) & CAM_INT_EN_HRESP_ERR_EN_MASK)
#define CAM_INT_EN_HRESP_ERR_EN_GET(x) (((uint32_t)(x) & CAM_INT_EN_HRESP_ERR_EN_MASK) >> CAM_INT_EN_HRESP_ERR_EN_SHIFT)

/*
 * EOF_INT_EN (RW)
 *
 * End-of-Frame Interrupt Enable. This bit enables and disables the EOF interrupt.
 * 0 EOF interrupt is disabled.
 * 1 EOF interrupt is generated when RX count value is reached.
 */
#define CAM_INT_EN_EOF_INT_EN_MASK (0x200U)
#define CAM_INT_EN_EOF_INT_EN_SHIFT (9U)
#define CAM_INT_EN_EOF_INT_EN_SET(x) (((uint32_t)(x) << CAM_INT_EN_EOF_INT_EN_SHIFT) & CAM_INT_EN_EOF_INT_EN_MASK)
#define CAM_INT_EN_EOF_INT_EN_GET(x) (((uint32_t)(x) & CAM_INT_EN_EOF_INT_EN_MASK) >> CAM_INT_EN_EOF_INT_EN_SHIFT)

/*
 * RF_OR_INTEN (RW)
 *
 * RxFIFO Overrun Interrupt Enable. This bit enables the RX FIFO overrun interrupt.
 * 0 RxFIFO overrun interrupt is disabled
 * 1 RxFIFO overrun interrupt is enabled
 */
#define CAM_INT_EN_RF_OR_INTEN_MASK (0x40U)
#define CAM_INT_EN_RF_OR_INTEN_SHIFT (6U)
#define CAM_INT_EN_RF_OR_INTEN_SET(x) (((uint32_t)(x) << CAM_INT_EN_RF_OR_INTEN_SHIFT) & CAM_INT_EN_RF_OR_INTEN_MASK)
#define CAM_INT_EN_RF_OR_INTEN_GET(x) (((uint32_t)(x) & CAM_INT_EN_RF_OR_INTEN_MASK) >> CAM_INT_EN_RF_OR_INTEN_SHIFT)

/*
 * FB2_DMA_DONE_INTEN (RW)
 *
 * Frame Buffer2 DMA Transfer Done Interrupt Enable. This bit enables the interrupt of Frame Buffer2 DMA
 * transfer done.
 * 0 Frame Buffer2 DMA Transfer Done interrupt disable
 * 1 Frame Buffer2 DMA Transfer Done interrupt enable
 */
#define CAM_INT_EN_FB2_DMA_DONE_INTEN_MASK (0x8U)
#define CAM_INT_EN_FB2_DMA_DONE_INTEN_SHIFT (3U)
#define CAM_INT_EN_FB2_DMA_DONE_INTEN_SET(x) (((uint32_t)(x) << CAM_INT_EN_FB2_DMA_DONE_INTEN_SHIFT) & CAM_INT_EN_FB2_DMA_DONE_INTEN_MASK)
#define CAM_INT_EN_FB2_DMA_DONE_INTEN_GET(x) (((uint32_t)(x) & CAM_INT_EN_FB2_DMA_DONE_INTEN_MASK) >> CAM_INT_EN_FB2_DMA_DONE_INTEN_SHIFT)

